cf/Catalogs/ИзмененияФункции.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<Catalog>
		<Properties>
			<Name>ИзмененияФункции</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Функции</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Заметки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХранилищеЗаметок</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХранилищеОписания</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВерсияОписания</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВерсииФайлов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВерсияИнструкции</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВерсииФайлов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

cf/Enums/ТипыФайлов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<Enum>
		<Properties>
			<Name>ТипыФайлов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ТехническоеОписание</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИнструкцияПользователя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДополнительнаяИнформация</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

cf/Catalogs/ИзмененияФункции/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаСервере
Процедура ПередЗаписьюНаСервере1(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ОбщегоНазначенияСППР.ПоместитьФорматированноеОписаниеВХранилище(Описание, ТекущийОбъект.ХранилищеОписания);
	ОбщегоНазначенияСППР.ПоместитьФорматированноеОписаниеВХранилище(Заметки, ТекущийОбъект.ХранилищеИнструкции);
	ТекущийОбъект.Описание = Описание.ПолучитьТекст();
	ТекущийОбъект.Инструкция = Заметки.ПолучитьТекст();
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ОбщегоНазначенияСППР.ПоместитьФорматированноеОписаниеВХранилище(Описание, ТекущийОбъект.ХранилищеОписания);
	ОбщегоНазначенияСППР.ПоместитьФорматированноеОписаниеВХранилище(Заметки, ТекущийОбъект.ХранилищеЗаметок);
	ТекущийОбъект.Описание = Описание.ПолучитьТекст();
	ТекущийОбъект.Заметки = Заметки.ПолучитьТекст();
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	РедактируемыйОбъект = РеквизитФормыВЗначение("Объект");
	
	ОбщегоНазначенияСППР.УстановитьФорматированноеОписаниеИзХранилища(Описание, РедактируемыйОбъект.ХранилищеОписания);
	ОбщегоНазначенияСППР.УстановитьФорматированноеОписаниеИзХранилища(Заметки, РедактируемыйОбъект.ХранилищеЗаметок);
	
КонецПроцедуры


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Ключ.Пустая() Тогда
		Объект.Ответственный = ТИ.ТекущийПользователь();
	КонецЕсли;
	
	ФайлТехническогоОписания = ТИ.ПолучитьФайлФункцииНаСервере(Объект.Владелец, ПредопределенноеЗначение("Перечисление.ТипыФайлов.ТехническоеОписание"));
	ФайлИнструкцииПользователя = ТИ.ПолучитьФайлФункцииНаСервере(Объект.Владелец, ПредопределенноеЗначение("Перечисление.ТипыФайлов.ИнструкцияПользователя"));
	
КонецПроцедуры

&НаКлиенте
Процедура ВерсияОписанияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Файл = ТИ.ПолучитьФайлФункцииНаСервере(Объект.Владелец, ПредопределенноеЗначение("Перечисление.ТипыФайлов.ТехническоеОписание"));
	Если Файл = Неопределено Тогда
		Сообщить("Не найден файл "+ПредопределенноеЗначение("Перечисление.ТипыФайлов.ТехническоеОписание"));
		Возврат;
	КонецЕсли;  
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Файл", Файл);
	ОповещениеОВыборе = Новый ОписаниеОповещения("ОбработкаВыбораВерсии", ЭтаФорма, ПредопределенноеЗначение("Перечисление.ТипыФайлов.ТехническоеОписание"));
	ОткрытьФорму("Справочник.ВерсииФайлов.Форма.ФормаВыбора", ПараметрыФормы, ЭтаФорма, УникальныйИдентификатор,,,ОповещениеОВыборе);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбораВерсии(Знач Результат, Знач ПараметрКоманды) Экспорт 
	
	Если НЕ ЗначениеЗаполнено(Результат) Тогда
		Возврат;
	КонецЕсли; 
	
	Если ПараметрКоманды = ПредопределенноеЗначение("Перечисление.ТипыФайлов.ТехническоеОписание") Тогда
		Объект.ВерсияОписания = Результат;
	ИначеЕсли  ПараметрКоманды = ПредопределенноеЗначение("Перечисление.ТипыФайлов.ИнструкцияПользователя") Тогда
		Объект.ВерсияИнструкции = Результат;
	КонецЕсли; 

КонецПроцедуры // ОбработкаВыбораВерсии()

&НаКлиенте
Процедура ВерсияИнструкцииНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Файл = ТИ.ПолучитьФайлФункцииНаСервере(Объект.Владелец, ПредопределенноеЗначение("Перечисление.ТипыФайлов.ИнструкцияПользователя"));
	Если Файл = Неопределено Тогда
		Сообщить("Не найден файл "+ПредопределенноеЗначение("Перечисление.ТипыФайлов.ИнструкцияПользователя"));
		Возврат;
	КонецЕсли;  
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Файл", Файл);
	ОповещениеОВыборе = Новый ОписаниеОповещения("ОбработкаВыбораВерсии", ЭтаФорма, ПредопределенноеЗначение("Перечисление.ТипыФайлов.ИнструкцияПользователя"));
	ОткрытьФорму("Справочник.ВерсииФайлов.Форма.ФормаВыбора", ПараметрыФормы,ЭтаФорма,УникальныйИдентификатор,,,ОповещениеОВыборе);
	
КонецПроцедуры
